---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType.ShowAll
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType
source: html/09990772-9602-6970-ea6a-c1bde188344a.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType.ShowAll

Show vector text label for each point